Repository: HalavicH/stalker-localization-toolbox
Catalog: src/locale/*/LC_MESSAGES/sltools.po
Languages: uk

source: Allow operations without Git repository
uk: Дозволити операції без репозиторію Git

source: Allow operations on dirty Git repositories
uk: Дозволити операції у нечистих репозиторіях Git

source: Allow operations on untracked by Git files
uk: Дозволити операції з файлами, які не відстежуються Git

source: app_description
uk: Цей додаток є універсальним рішенням для роботи з локалізацією сталкера Параметри налагодження (змінні середовища): [cyan]PY_ST=true[/cyan] - вмикає стек-трейс необроблених помилок [cyan]PLOG_LEVEL=\[debug,info,warning,error,critical][/cyan] - встановлює рівень журналу для всього додатку

source: Sub-commands available:
uk: Доступні підкоманди:

source: Validate encoding of a file or directory
uk: Перевірити кодування файлу або каталогу

source: Paths to files or directories
uk: Шляхи до файлів або каталогів

source: Fix UTF-8 encoding of a file or directory (Warning: may break encoding if detected wrongly)
uk: Виправити кодування UTF-8 файлу або каталогу (Увага: може зламати кодування, якщо воно визначено неправильно)

source: Validate XML of a file or directory
uk: Перевірити XML файлу або каталогу

source: Format XML of a file or directory
uk: Форматувати XML файлу або каталогу

source: Fix XML issues if possible instead of skipping the file
uk: Виправити проблеми XML, якщо це можливо, замість пропуску файлу

source: Format <text> tag contents to resemble in-game appearance
uk: Форматувати вміст тегу <text>, щоб він відповідав зовнішньому вигляду у грі

source: Check primary language of a file or directory
uk: Перевірити основну мову файлу або каталогу

source: Language to exclude from the report separated with "+". E.g:
uk: Мова для виключення з звіту, розділена "+". Наприклад:

source: Show detailed report with language occurrences per file
uk: Показати детальний звіт з входженнями мови на файл

source: Translate text in a file or directory
uk: Перекласти текст у файлі або каталозі

source: Source language (auto-detect if missing)
uk: Мова джерела (автоматичне виявлення, якщо відсутнє)

source: Target language
uk: Мова призначення

source: API key for translation service
uk: API-ключ для сервісу перекладу

source: Analyze patterns in a file or directory
uk: Аналізувати шаблони у файлі або каталозі

source: Compare freshly-generated analysis with one provided in file
uk: Порівняйте свіжосформований аналіз із наданим у файлі

source: Please provide args. Use %s for help
uk: Будь ласка, надайте аргументи. Використовуйте %s для довідки
