Repository: HalavicH/stalker-localization-toolbox
Catalog: sltools/locale/*/LC_MESSAGES/sltools.po
Languages: uk

source: Allow operations without Git repository
uk: Дозволити операції без репозиторію Git

source: Allow operations on dirty Git repositories
uk: Дозволити операції у нечистих репозиторіях Git

source: Allow operations on untracked by Git files
uk: Дозволити операції з файлами, які не відстежуються Git

source: app_description
uk: Цей додаток є універсальним рішенням для роботи з локалізацією сталкера Параметри налагодження (змінні середовища): [cyan]PY_ST=true[/cyan] - вмикає стек-трейс необроблених помилок [cyan]PLOG_LEVEL=\[debug,info,warning,error,critical][/cyan] - встановлює рівень журналу для всього додатку

source: Sub-commands available:
uk: Доступні підкоманди:

source: Validate encoding of a file or directory
uk: Перевірити кодування файлу або файлів в папці

source: Paths to files or directories
uk: Шляхи до файлів або папок з файлами

source: Fix UTF-8 encoding of a file or directory (Warning: may break encoding if detected wrongly)
uk: Виправити кодування UTF-8 файлу або файлів в папці (Увага: може зламати кодування, якщо воно визначено неправильно)

source: Validate XML of a file or directory
uk: Провалідувати XML файл або файли в папці на правильність

source: Format XML of a file or directory
uk: Форматувати XML файл або файли в папці

source: Fix XML issues if possible instead of skipping the file
uk: Виправити проблеми XML, якщо це можливо, замість пропуску файлу

source: Format <text> tag contents to resemble in-game appearance
uk: Форматувати вміст тегу <text>, щоб він відповідав зовнішньому вигляду у грі

source: Check primary language of a file or directory
uk: Перевірити основну мову файлу або файлів в папці

source: Show detailed report with language occurrences per file
uk: Показати детальний мовний звіт для кожної репліки в файлі

source: Translate text in a file or directory
uk: Перекласти текст у файлі або папці з файлами

source: Source language (auto-detect if missing)
uk: Мова джерела (автоматичне виявлення, якщо відсутнє)

source: Target language
uk: Мова призначення

source: API key for translation service
uk: API-ключ для сервісу перекладу

source: Analyze patterns in a file or directory
uk: Аналізувати шаблони у файлі або папці з файлами

source: Save detailed report as JSON file (for future comparison)
uk: Зберегти детальний звіт у вигляді JSON-файлу (для подальшого порівняння)

source: Capitalize first letter [cyan](a->A)[/cyan] in all text entries in a file or directory
uk: Зробити кожен текст блок з великої літери [cyan](a->A)[/cyan] (ОБЕРЕЖНО! капіталізує абсолютно все)

source: Display detailed report with string text
uk: Відображення детального звіту для кожного рядку

source: Display duplicates as D3 interactive graph
uk: Відобразити дублікати у вигляді інтерактивної діаграми D3

source: Save filecentric report as JSON
uk: Зберагти файлоцентричний звіт у форматі JSON файлу

source: Paths to two files you want to compare and sort dups
uk: Шляхи до двох файлів, які потрібно порівняти та відсортувати дублікати

source: Language to exclude from the report separated with "+". E.g: [cyan]--exclude uk+en[/cyan]
uk: Мова, яку потрібно виключити зі звіту, відокремлюється знаком "+". Наприклад: [cyan]--виключити uk+en[/cyan].

source: Don't sort non-duplicates
uk: Сортувати лише дублікати

source: Start
uk: Старт

source: Failed to perform actions. Error: %s
uk: Не вдалося виконати дії. Помилка: %s

source: Done! Total time: %s
uk: Готово! Зайняло часу: %s

source: Looks for duplicates of [green]'<string id="...">'[/green] to eliminate unwanted conflicts/overrides. Provides filecentric report by default
uk: Шукає дублікати [green]'<string id="...">'[/green] для усунення небажаних конфліктів/перевизначень. За замовчуванням надає файло-орієнтований звіт

source: Sorts strings in files alphabetically placing duplicates on top
uk: Сортує рядки у файлах за алфавітом, розміщуючи повтори зверху

source: Unknown
uk: Невідомо

source: Too little data
uk: Замало даних для аналізу

source: Processing command: %s
uk: Обробка команди: %s

source: Command '%s' is not implemented
uk: Команда '%s' не реалізована

source: Git is not available on this system. It's vital to have files in a git repo to prevent potential file damage. Please install Git.
uk: Git недоступний в цій системі. Важливо мати файли в git-репозиторії, щоб запобігти потенційному пошкодженню файлів. Будь ласка, встановіть Git.

source: Running command '%s' on paths: '%s'
uk: Виконую команду '%s' для шляхів: %s

source: Can't log error due to fucking rich formatter. Fixme.
uk: Не можу залогувати помилку через клятий форматтер. Убийте мене.

source: Unknown loglevel:
uk: Невідомий рівень логування:

source: New log level:
uk: Новий рівень логування:

source: [bright_black]You are using the latest version of sltools.[/bright_black]
uk: [bright_black]Ви використовуєте останню версію sltools.[/bright_black]

source: Failed to check for updates: %s
uk: Не вдалося перевірити наявність оновлень: %s

source: %s is not instance of set. Don't know how to default it
uk: %s не є екземпляром set(). Не знаю, дефолтного значення для неї

source: Shutting down server!!!
uk: Завершення роботи сервера!!!

source: Dead :D
uk: Мертвий :D

source: Try to open %s
uk: Намагаюсь відкрити %s

source: Command executed successfully!
uk: Команда успішно виконана!

source: Can't sort files: %s
uk: Не можу сортувати файли: %s

source: Both file paths are required!
uk: Потрібні шляхи до обох файлів!

source: Running diff with: '%s'
uk: Виконання різниці з: '%s'

source: Can't diff files: %s
uk: Не можу порівняти файли: %s

source: Watching for changes in files
uk: Спостереження за змінами у файлах

source: %s has been %s
uk: %s було %s

source: Files changed
uk: Файли змінені

source: File: '%s'
uk: Файл: '%s'

source: Failed files errors:
uk: Помилки при обробці файлів:

source: Could not extract position from error message: %s
uk: Не вдалося витягнути позицію з повідомлення про помилку: %s

source: Illegal character! Error at row %s, column %s:
uk: Недопустимий символ! Помилка у рядку %s, стовпці %s:

source: Can't decode file %s as ascii. Error %s
uk: Не можу декодувати файл %s як ascii. Помилка %s

source: Can't decode file %s as windows-1251. Error %s
uk: Не можу декодувати файл %s як windows-1251. Помилка %s

source: Folded text %s
uk: Згорнутий текст %s

source: Number of "\n" replaced with newline: %s
uk: Кількість "\n", замінених на новий рядок: %s

source: Replaced text %s
uk: Текст замінено %s

source: Number of newline replaced with "\n": %s
uk: Кількість нових рядків, замінених на "\n": %s

source: Pattern matches: %s
uk: Відповідають шаблону: %s

source: No XML file found under path: '%s'. Please provide path which contains xml files
uk: За шляхом '%s' не знайдено XML файлів. Будь ласка, вкажіть шлях (файл/папка), який містить XML файли з локалізацією

source: Found following glob files: %s
uk: Знайдені такі glob файли: %s

source: Input files number: %s
uk: Кількість файлів для обробки: %s

source: Warning: File %s doesn't have encoding header in it
uk: Попередження: У файлі %s немає заголовка кодування

source: Try to detect and fix comments
uk: Намагаюсь виявити та виправити коментарі

source: Try to detect and fix ampersand issues
uk: Намагаюсь виявити та виправити проблеми з амперсандом

source: Try to detect and resolve includes
uk: Намагаюсь виявити та вставити файли '#include ...'

source: Try to detect and fix XML declaration
uk: Намагаюсь виявити та виправити декларацію XML

source: Done with fixing
uk: Виправлення завершено

source: modified
uk: модифіковано

source: created
uk: створено

source: deleted
uk: видалено

source: Monitoring
uk: Моніторинг

source: Skipped files due to being dirty/not tracked by git:
uk: Пропущені файли через те, що вони брудні/не відстежуються git:

source: 'It seems that there's no git repository here. Skipping the file processing.
uk: 'Здається, тут немає git-репозиторію. Пропускаємо обробку файлу.

source: 'File %s' is not tracked by git. Skipping the file processing.
uk: 'Файл %s' не відстежується git. Пропускаємо обробку файлу.

source: File '%s' is dirty (modified but not staged/committed). Skipping the file processing.
uk: Файл '%s' "брудний" - змінений, але не застейджений (git add) чи закомічений (git commit). Пропускаю обробку файлу.

source: Note: If you sure you won't break anything, you can process this path anyway using %s
uk: Примітка: Якщо ви впевнені, що нічого не зламаєте, ви можете дозволити обробити цей файл, використовуючи %s

source: Lang %s is in excludes. Skipping
uk: Мова %s знаходиться у виключеннях. Пропускаю

source: Can't detect language for the whole file. Probably it's empty
uk: Не вдається визначити мову для всього файлу. Можливо, він порожній?

source: Analyzing primary language for
uk: Аналіз основної мови для

source: Total processed files: %s
uk: Всього оброблено файлів: %s

source: No files detected!. Nothing to show
uk: Файлів не знайдено! Нема чого показувати.

source: Short report on language. Total: %s files
uk: Короткий звіт про основну мову в файлах. Всього: %s файлів

source: Filename
uk: Ім'я файлу

source: Main Lang
uk: Основна мова

source: Detailed report (per each string). Total: %s files
uk: Детальний звіт (для кожної фрази). Всього: %s файлів

source: Language
uk: Мова

source: Count
uk: Кількість

source: Found duplicate of '%s' in '%s'
uk: Знайдено повторення '%s' в '%s'

source: Analyzing patterns for
uk: Аналіз шаблонів для

source: Total processed files: %d
uk: Всього оброблено файлів: %d

source: Can't change encoding for %s. Rolling back...
uk: Не вдається змінити кодування для %s. Відкочую назад...

source: All files analyzed! Fixing encodings...
uk: Всі файли проаналізовано! Виправлення кодувань...

source: NOTE! Currently, reliable detection is only available for UTF-8 encoding.
uk: УВАГА: Наразі надійне розпізнавання доступне лише для кодування UTF-8.

source: For other suspicious files, manual review and encoding correction may be necessary.
uk: Для інших підозрілих файлів може знадобитися ручна перевірка та виправлення кодування.

source: Nothing to fix
uk: Нічого випрвляти :)

source: There is/are %d file(s) to fix
uk: Всього %d файлів, які потрібно виправити

source: Try to change encoding from %s to %s for file %s
uk: Намагаюсь змінити кодування з %s на %s для файлу %s

source: Success!
uk: Успішно!

source: Can't encode from %s to %s
uk: Не вдається перекодувати з %s в %s

source: File %s possibly has %s encoding. But maybe no, so won't do anything
uk: Файл %s, можливо, має кодування %s. Але може і ні, тому нічого не буде зроблено

source: %s %s files
uk: %s %s файлів

source: Processing file [green]#%03d[/] with name [green]%s[/]
uk: Опрацьовую файл [green]#%03d[/] з іменем [green]%s[/].

source: Analyzing patterns usage and errors
uk: Аналіз використання шаблонів/змінних і їх помилок

source: Saving the report at [cyan]%s[/cyan]
uk: Збереження звіту за адресою [cyan]%s[/cyan]

source: Displaying report
uk: Відображення звіту

source: Summary:
uk: Підсумок:

source: Patterns:
uk: Паттерни/змінні:

source: No pattern syntax errors detected
uk: Помилок синтаксису патернів/змінних не виявлено

source: Errors:
uk: Помилки:

source: [cyan]In file:[/cyan] %s:
uk: [cyan]У файлі:[/cyan] %s:

source: [cyan]In string with id:[/cyan] '%s'
uk: [cyan]У рядку з id:[/cyan] '%s'

source: Error: %s
uk: Помилка: %s

source: Can't import git module. In seems that git is not installed
uk: Не вдається імпортувати модуль git. Здається, що git не встановлено

source: Can't process strings for file: '%s'. Error: %s
uk: Не вдається обробити рядки файлу: '%s'. Помилка: %s

source: Can't get strings for file: '%s'. Error: %s
uk: Не вдається отримати рядки файлу: '%s'. Помилка: %s

source: . Row: %s, column %s
uk: . Рядок: %s, колонка %s

source: Meta-data:
uk: Метадані:

source: Missing files in current analysis: %s
uk: Файли, що відсутні в поточному аналізі: %s

source: Extra files in current analysis: %s
uk: Додаткові файли в поточному аналізі: %s

source: ###### Mismatch in reports detected! ######
uk: ###### Виявлено невідповідність у звітах! ######

source: Total missmatch:
uk: Всього невідповідностей:

source: Pattern: '%s', %d %s than before. Before %d after %d
uk: Шаблон: '%s', зустрічається на %d разів %s ніж до цього. До: %d після: %d

source: Mismatched files:
uk: Невідповідності в файлах:

source: Mismatched strings:
uk: Невідповідності в фразах:

source: String: '%s'
uk: Фраза: '%s'

source: Versions match! Jolly good!
uk: Версії збігаються! Чудово!

source: more
uk: більше

source: less
uk: менше

source: Text of '%s' was capitalized
uk: Текст '%s' тепер починається з великої літери

source: No files were modified
uk: Жодні файли не було змінено

source: File
uk: Файл

source: Cnt
uk: К-ть

source: Capitalized text blocks per file. Total files modified: %d
uk: Блоки тексту з великої літери в кожному файлі. Загальна кількість змінених файлів: %d

source: Error
uk: Помилка

source: Disabled
uk: Вимкнено

source: Yes
uk: Так

source: No
uk: Ні

source: Unhandled error %s
uk: Необроблена помилка %s

source: Fix option enabled. Will fix:
uk: Увімкнено опцію виправлення. Виправлю:

source: - Guard '--' in comments,
uk: - '--' в коментах,

source: - Ampersand misuse (& -> &amp;),
uk: - Неправильне використання амперсанду (& -> &amp;),

source: - Resolve #include
uk: - Вирішу включення інших файлів (#include)

source: - Wrong/missing XML declaration
uk: - Неправильну/відсутню XML декларацію

source: Format <text> content option enabled. Will make text look as similar as possible to the in-game text
uk: Увімкнено опцію форматування тексту всередині <text>. Це зробить текст максимально схожим на текст у грі

source: Formatting XML-schema for
uk: Форматування XML-схеми для

source: You've just wasted your CPU cycles 😈
uk: Ви щойно даремно витратили свої процесорні цикли 😈.

source: No files required formatting. %s
uk: Файли не потребують форматування. %s

source: Files which were requiring some fixes/formatting (total: %d)
uk: Файли, які потребували виправлення/форматування (всього: %d)

source: Fixed
uk: Виправлено

source: Formatted <text>
uk: Відформатовано <text>

source: Formatted
uk: Відформатовано XML

source: These files have syntax/other errors in them, so they weren't formatted.
uk: Ці файли містять синтаксичні та інші помилки, тому вони не були відформатовані.

source: Run command with --fix option to try to fix errors automatically
uk: Запусти команду з опцією --fix, щоб спробувати виправити помилки автоматично

source: API request failed
uk: Не вдалося виконати запит до API

source: guessed lang:
uk: вгадана мова:

source: Fatal error during translation
uk: Фатальна помилка під час перекладу

source: Empty text block for string '%s'
uk: Порожній текстовий блок для рядка '%s'

source: Text with id '%s' is already translated
uk: Текст з ідентифікатором '%s' вже перекладено

source: Text prepared for translation
uk: Текст, підготовлений до перекладу

source: Translating text with id '%s'
uk: Переклад тексту з ідентифікатором '%s'

source: Translating from '%s' to '%s'
uk: Переклад з '%s' на '%s'

source: Access forbidden. It seems that the token is invalid or expired
uk: Доступ заборонено. Здається, що токен недійсний або термін дії закінчився

source: File %s is ok. Encoding: %s
uk: Файл %s в порядку. Кодування: %s

source: Validating encoding for
uk: Перевірка кодування для

source: No files with bad encoding detected!
uk: Файлів з поганим кодуванням не виявлено!

source: Files with possibly incompatible/broken encoding (total: %d)
uk: Файли з можливо несумісним/пошкодженим кодуванням (всього: %d)

source: Encoding
uk: Кодування

source: Comment
uk: Коментар

source: Sorting files: '%s' and '%s'
uk: Сортування файлів: '%s' та '%s'

source: Processing file: '%s'
uk: Файл що обробляється: '%s'

source: Done with file: '%s'
uk: Обробка завершена для файлу: '%s'

source: Sorting all entries instead of only duplicates
uk: Сортування всіх записів, а не лише дублікатів

source: Identical duplicated strings (safe to delete one of them)
uk: Ідентичні рядки, що повторюються (можна безпечно видалити один з них)

source: Duplicated string IDs with different content (requires inspection)
uk: Дубльовані ідентифікатори рядків з різним вмістом (потребує перевірки)

source: Unique string IDs (keeping as is)
uk: Унікальні ідентифікатори рядків (залишити як є)

source: appending %s
uk: додаю %s

source: Can't open file %s as %s encoded. Error: %s
uk: Не вдається відкрити файл %s у кодуванні %s. Помилка: %s

source: Validating XML-schema for
uk: Перевірка XML-схеми для

source: All files are valid. Congrats
uk: Всі файли валідні. Вітаю.

source: Found %d invalid files:
uk: Знайдено %d поламаних файлів:

source: File: %s
uk: Файл: %s

source: Issues:
uk: Проблеми:

source: Dirty
uk: Брудний файл

source: Warning: File %s has invalid header in it
uk: Попередження: Файл %s має неправльну декларацію в ньому

source: Expected version='1.0' got '%s'
uk: Очікувана версія='1.0' отримала '%s'

source: Expected encoding='%s' got '%s'
uk: Очікуване кодування='%s' отримано '%s'

source: Wrong XML declaration. %s %s
uk: Неправильне оголошення XML. %s %s

source: Provided plain string. Encoding to
uk: Надано str() рядок. Перекодування в:

source: XML file has '--' within comment. First occurrence at: %s
uk: XML-файл містить '--' у коментарі. Зустрічається вперше в: %s

source: XML file is empty which is not allowed
uk: XML-файл порожній, що є неприпустимим

source: Can't parse root tag. Error: %s
uk: Не вдається розпарсити кореневий тег. Помилка: %s

source: Fixed typical XML errors
uk: Виправлено типові помилки XML

source: Formatted XML schema
uk: Відформатовано XML схему

source: Formatted <text> entries
uk: Відформатований текст в тегах <text>

source: Text of '%s' was formatted
uk: Текст під айді '%s' було відформатовано

source: Configure application settings
uk: Налаштування параметрів програми

source: Set default log level. (Available: %s)
uk: Встановити рівень логування за замовчуванням. (Доступно: %s)

source: Set app language. (Available: %s)
uk: Встановити мову програми. (Доступно: %s)

source: Enable/Disable showing error stack trace (Available: True/False)
uk: Увімкнути/вимкнути відображення стектрейсу помилки (Доступно: True/False)

source: Set new default log level to '%s'
uk: Новий рівень логування за замовчуванням: '%s'

source: Set new app language to '%s'
uk: Вибрано мову програми: '%s'

source: Stacktrace printing on failure ENABLED
uk: Увімкнено друк трасування стека в разі збою

source: Stacktrace printing on failure DISABLED
uk: Вимкнено друк трасування стека в разі збою

source: Extra content at the end of the document, line %s, column %s (tag %s, line %s)
uk: Додатковий вміст у кінці документа, рядок %s, стовпець %s (тег %s, рядок %s). [cyan]Файл має закінчуватись </string_table>[/cyan]

source: Opening and ending tag mismatch: %s line %s and %s, line %s, column %s
uk: Невідповідність початкового та кінцевого тегів. Початок: %s рядок %s, кінець: %s, рядок %s, стовпець %s. [cyan]Перевір файл на цілісність[/cyan]

source: Premature end of data in tag %s line %s, column %s
uk: Передчасне завершення даних у тезі %s рядок %s, стовпець %s. [cyan]Перевір файл на цілісність[/cyan]

source: Expected '>', line %s, column %s
uk: Очікувався закриваючи символ '>', (рядок %s, стовпець %s). [cyan]Перевір файл на цілісність[/cyan]

source: XML declaration allowed only at the start of the document, line %s, column %s
uk: Оголошення XML декларації дозволено лише на початку документа, (натомість вона на рядку %s, стовпці %s). [cyan]Прибери порожні строчки/коменти перед декларацією[/cyan]

source: Input is not proper UTF-8, indicate encoding
uk: Файл не має XML декларації. [cyan]Додай декларацію [green]'<?xml version="1.0" encoding="WINDOWS-1251" ?>'[/green] на першу строчку файлу[/cyan]

source: Unsupported encoding %s, line %s, column %s
uk: Кодування %s не підтримується, рядок %s, стовпець %s. [cyan]Додай/заміни декларацію на [green]'<?xml version="1.0" encoding="WINDOWS-1251" ?>'[/green] на першій строчці файлу[/cyan]

source: Unknown error:
uk: Невідома помилка:

source: String not closed, expecting '"' or ''', line %s, column %s
uk: Рядок не закрито, очікується '"' або ''', рядок %s, стовпець %s. [cyan]Перевір файл на цілісність[/cyan]

source: Can't resolve include! No such file or directory: %s
uk: Не вдається знайти файл що включається за допомогою #include! Файлу '%s' не існує. [cyan]Перевір наявність файлу що включається, а краще не використовуй #include взагалі :)[/cyan]

source: The XML declaration is incorrect
uk: XML-декларація некоректна. [cyan]Додай/заміни декларацію на [green]'<?xml version="1.0" encoding="WINDOWS-1251" ?>'[/green] на першій строчці файлу[/cyan]

source: XML document is empty
uk: Порожній XML-документ (немає кореневого тегу). [cyan]Видали файл, або додай порожній [green]<string_table></string_table>[/green] тег в кінці файлу[/cyan]

source: The document has %s-like macro which is not recommended. Try to resolve
uk: Документ містить %s-подібний макрос, що не рекомендується. [cyan]Рекомендується зкопіювати вміст файлу і вставити його замість інклюду[/cyan]

source: #include "some/other/file.xml"
uk: #include "якийсь/інший/файл.xml"
